init.el
;;; init.el --- Emacs Configuration -*- lexical-binding: t -*-
(defconst emacs-start-time (current-time))

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org"   . "https://orgmode.org/elpa/")
                         ("elpa"  . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(setq auto-save-default nil
      create-lockfiles  nil
      make-backup-files nil)

(global-auto-revert-mode 1)

(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)

(setq-default truncate-lines t)

(use-package whitespace
  :init
  (setq sentence-end-double-space nil
        whitespace-style '(face empty trailing))

  (setq-default indent-tabs-mode nil)

  (global-whitespace-mode)
  (add-hook 'before-save-hook #'whitespace-cleanup))

(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(blink-cursor-mode -1)

(setq inhibit-startup-message t)

(use-package ibuffer
  :bind (("C-x C-b" . ibuffer))
  :config
  (setq ibuffer-use-other-window t))

(use-package icomplete
  :init
  (fido-mode 1))

(set-face-attribute 'default nil :font "Ubuntu Mono" :height 125)
(set-face-attribute 'fixed-pitch nil :font "Ubuntu Mono" :height 125)
(set-face-attribute 'variable-pitch nil :font "Ubuntu Light" :height 125)

(use-package all-the-icons
  :ensure t)

(global-display-line-numbers-mode 1)

(dolist (hook '(doc-view-mode-hook
                eshell-mode-hook
                gfm-mode-hook
                org-mode-hook
                shell-mode-hook
                term-mode-hook))
  (add-hook hook (lambda () (display-line-numbers-mode 0))))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (column-number-mode 1)
  (size-indication-mode 1)
  (setq doom-modeline-buffer-file-name-style 'relative-to-project
        doom-modeline-buffer-modification-icon t
        doom-modeline-buffer-state-icon t
        doom-modeline-height 25
        doom-modeline-major-mode-icon t
        doom-modeline-major-mode-color-icon nil
        doom-modeline-minor-modes nil))

(use-package tab-bar
  :config
  (setq tab-bar-show nil))

(use-package modus-themes
  :ensure t
  :bind ("<f5>" . modus-themes-toggle)
  :init
  (setq modus-themes-diffs              'desaturated
        modus-themes-headings           '((t . rainbow-section-no-bold))
        modus-themes-intense-hl-line    t
        modus-themes-lang-checkers      'straight-underline
        modus-themes-links              'faint-neutral-underline
        modus-themes-org-blocks         'grayscale
        modus-themes-paren-match        'intense-bold
        modus-themes-region             'bg-only-no-extend
        modus-themes-scale-headings     t
        modus-themes-slanted-constructs t)

  ;; Default to the light theme
  (modus-themes-load-operandi)

  (show-paren-mode 1))

(defun me/buffer-select-by-major-mode (mode)
  "A filter for use with `display-buffer-alist', will select a
  buffer if it matches the given major-mode"
  (lambda (buffer action)
    (with-current-buffer buffer
      (eq major-mode mode))))

(defun me/display-tabbed-buffer-in-side-window (buffer alist)
  "See `display-buffer-in-side-window'"
  (display-buffer-in-side-window buffer alist)
  (with-current-buffer buffer
    (tab-line-mode)))

(dolist (hook '(shell-mode-hook
                eshell-mode-hook))
  (add-hook hook (lambda () (tab-line-mode))))
(defun me/display-buffer-in-panel (predicate)
  "Display buffers matching the given PREDICATE in the panel.

To borrow terminology from VSCode the panel is that collapsable
window at the bottom of the screen.
"
  `(,predicate
    (me/display-tabbed-buffer-in-side-window)
    (window-height . 0.25)
    (side . bottom)
    (slot . 0)
    (window-parameters . ((no-other-window . t)))))


(use-package window
  :init
  (setq display-buffer-alist `(,(me/display-buffer-in-panel "\\*Help\\*")
                               ,(me/display-buffer-in-panel "\\*\\(e?shell\\)\\*")
                               ,(me/display-buffer-in-panel
                                 (me/buffer-select-by-major-mode 'compilation-mode))
                               ,(me/display-buffer-in-panel "\\*Ibuffer\\*")
                               (,(me/buffer-select-by-major-mode 'dired-mode)
                                (display-buffer-in-side-window)
                                (window-width . 0.15)
                                (side . left)
                                (slot . 0)
                                (window-parameters . ((no-other-window . t))))
                               ,(me/display-buffer-in-panel
                                 (me/buffer-select-by-major-mode 'inferior-python-mode))
                               ))
  :bind (("<f8>" . window-toggle-side-windows)))
