README.org
**** Display In Top Window

I quite like having any temporary buffers like =*Completions*= pop up in a top
side window and then vanish again.

#+begin_src emacs-lisp :noweb-ref window-functions
  (defun me/display-buffer-in-top-window (predicate)
    "Display buffers matching the given PREDICATE in a top side window."

    `(,predicate
        (display-buffer-in-side-window)
        (window-height . 0.2)
        (side . top)
        (slot . 0)
        (window-parameters . ((no-other-window . t)))))

#+end_src

* Programs
** Dired

#+begin_src emacs-lisp :tangle init.el :noweb yes
  <<dired-functions>>

  (use-package dired
    :bind (("C-x d" . me/dired-open-directory))
    :hook (dired-mode . me/dired-mode-tweaks))
#+end_src

*** Open dired directory

A quick command that opens the ~default-directory~ in ~dired~

#+begin_src emacs-lisp :noweb-ref dired-functions
  (defun me/dired-open-directory ()
    (interactive)
    (dired default-directory))

#+end_src

*** Tweaks

A collection of tweaks to apply to new ~dired~ buffers

#+begin_src emacs-lisp :noweb-ref dired-functions
  (defun me/dired-mode-tweaks ()
    (dired-hide-details-mode))
#+end_src

*** Window Placement

Ensure that ~dired~ buffers open in a side window

#+begin_src emacs-lisp :noweb-ref window-placement-rules
  (,(me/buffer-select-by-major-mode 'dired-mode)
   (display-buffer-in-side-window)
   (window-width . 0.15)
   (side . left)
   (slot . 0)
   (window-parameters . ((no-other-window . t))))
#+end_src

** Elfeed

   [[https://github.com/skeeto/elfeed][elfeed]] is an RSS feed reader for Emacs.

#+begin_src emacs-lisp :tangle init.el :noweb yes
  <<elfeed-functions>>

  (use-package elfeed
    :bind (("C-c e" . me/elfeed-start)
           :map elfeed-search-mode-map
           ("g" . me/elfeed-update)
           :map elfeed-show-mode-map
           ("q" . delete-window))
    :ensure t
    :config
    (setq elfeed-use-curl t)
    <<elfeed-config>>)
#+end_src

*** Startup

Custom startup function to ensure that elfeed runs in a dedicated tab.

#+begin_src emacs-lisp :noweb-ref elfeed-functions
  (defun me/elfeed-start-new-tab ()
    "Does the work of creating a new tab"
    (tab-bar-new-tab)
    (tab-bar-rename-tab "elfeed")
    (elfeed))

  (defun me/elfeed-start ()
    "Switch to the elfeed tab, create one if it doesn't exist."
    (interactive)
    (let ((tabs (mapcar (lambda (tab) (alist-get 'name tab)) (tab-bar-tabs))))
      (if (member "elfeed" tabs)
          (tab-bar-select-tab-by-name "elfeed")
        (me/elfeed-start-new-tab))))

#+end_src

*** Feeds

I know that there's the [[https://github.com/remyhonig/elfeed-org][elfeed-org]] package that lets you configure elfeed feeds
through an org file, but I thought it would be a good exercise in Elisp to see
if I could put something similar together.

Rather than using headlines I've thrown all the links and corresponding tags
into a table and wrote a few functions that will convert the table into the
format required by [[help:elfeed-feeds][elfeed-feeds]] and set the variable to the result.

#+NAME: elfeed-feed-table
| URL                                                                          | Tags        |
|------------------------------------------------------------------------------+-------------|
| https://pointieststick.com/feed/                                             | linux kde   |
| https://blog.gtk.org/rss                                                     | linux gtk   |
| https://blogs.gnome.org/shell-dev/rss                                        | linux gnome |
| https://sachachua.com/blog/category/emacs/feed/                              | emacs       |
| https://www.youtube.com/feeds/videos.xml?channel_id=UC5Qw7uMu8_QMJHBw3mQJ62w | linux yt    |

#+NAME:feeds
#+begin_src emacs-lisp :noweb-ref elfeed-functions
  (defun me/feed-table-row-to-item (row)
    "Convert a ROW from a feed table into a valid elfeed entry"
    (let* ((url     (car row))
           (tags    (split-string (cadr row) " ")))

      (append (list url) (mapcar 'make-symbol tags))))

  (defun me/feed-table-to-list (feed-table)
    "Convert an orgmode FEED-TABLE to a list compatible with elfeed."
    (mapcar 'me/feed-table-row-to-item feed-table))


  (defun me/feed-table-extract ()
    "Find the table called `elfeed-feed-table' in my config file
  and use it to set the `elfeed-feeds' variable."
    (with-temp-buffer
      (insert-file-contents "/home/alex/.emacs.d/README.org")
      (org-table-map-tables (lambda ()
                              (setq tbl-name (plist-get (cadr (org-element-at-point)) :name))
                              (if (string= tbl-name "elfeed-feed-table")
                                  (let ((tbl (cdr (cdr (org-table-to-lisp)))))
                                    (setq elfeed-feeds (me/feed-table-to-list tbl)))))
                            t)))

  (defun me/elfeed-update (arg)
    "Refresh all RSS feeds.

    This simply calls `elfeed-update' unless the prefix arg is set
    or `elfeed-feeds' is nil in which case it will call
    `me/feed-table-extract' beforehand."
    (interactive "P")
    (if (or (not (null arg))
                (null elfeed-feeds))
        (me/feed-table-extract))
    (elfeed-update))
#+end_src

***  Window Placement

Open article buffers below the main summary list.

#+begin_src emacs-lisp :noweb-ref window-placement-rules
  ("\\*elfeed-entry\\*"
    (display-buffer-reuse-mode-window display-buffer-at-bottom)
    (window-height . 0.8))
#+end_src

In order for this setting to work as expected though we need to tweak how elfeed
manages its buffers

#+begin_src emacs-lisp :noweb-ref elfeed-config
(setq elfeed-show-entry-switch 'pop-to-buffer)
(setq elfeed-show-entry-delete 'delete-window)
#+end_src

** Git

*** Git Gutter

#+begin_src emacs-lisp :tangle init.el
  (use-package git-gutter
    :config
    (global-git-gutter-mode 1)

    (set-face-foreground 'git-gutter:added "forest green")
    (set-face-foreground 'git-gutter:modified "goldenrod")
    (set-face-foreground 'git-gutter:deleted "brown")

    (setq git-gutter:added-sign "▐"
          git-gutter:modified-sign "▐"
          git-gutter:removed-sign "▐"))
#+end_src

*** Magit

#+begin_src emacs-lisp :tangle init.el
  (use-package magit
    :bind (("C-x g" . magit-status)))
#+end_src

** LSP Mode

#+begin_src emacs-lisp :tangle init.el
  (use-package lsp-mode
    :ensure t
    :init
    (setq lsp-keymap-prefix "C-c l")
    :hook ((python-mode . lsp))
    :commands lsp)
#+end_src

** Org Mode

#+begin_src emacs-lisp :tangle init.el :noweb yes
  <<org-packages>>

  <<org-functions>>

  (use-package org
    :hook (org-mode . me/org-mode-tweaks)
    :bind (("C-c a" . org-agenda)
           ("C-c c" . org-capture))
    :config
    (setq org-directory "~/Documents/org/")
    <<org-config>>)
#+end_src

*** Org Agenda

#+begin_src emacs-lisp :noweb-ref org-config
  (setq org-agenda-files (list org-directory))
#+end_src

*** Org Babel

In order to execute code in source blocks we need to ensure that ~org-babel~ has
loaded support for it

#+begin_src emacs-lisp :noweb-ref org-config
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((emacs-lisp . t)
                                 (python . t)
                                 (shell . t)))
#+end_src

*** Org Capture

#+begin_src emacs-lisp :noweb-ref org-config
  (setq org-capture-templates
        '(("t" "Task" entry (file+headline "life.org" "Events")
           "* TODO %?\n")
          ("e" "Event" entry (file+headline "life.org" "Events")
           "* %?\nSCHEDULED: %^t")
          ("j" "Journal" entry (file+headline "life.org" "Journal")
           "* %u\n%?\n\n** Exercise\n" :prepend t)))
#+end_src

*** TODOs and Habits

#+begin_src emacs-lisp :noweb-ref org-config
  (add-to-list 'org-modules 'org-habit t)
  (setq org-adapt-indentation 'headline-data
        org-habit-show-all-today t
        org-log-into-drawer t)
#+end_src

*** Tweaks

A collection of tweaks to apply when opening a new org file

#+begin_src emacs-lisp :noweb-ref org-functions
  (defun me/org-mode-tweaks ()
    (setq-local fill-column 80)
    (turn-on-auto-fill)
    (flyspell-mode)

    (variable-pitch-mode 1)

    ;; Switch certain elements back to fixed pitch
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-link nil :inherit '(button fixed-pitch))
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil
                        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

** Project Management

#+begin_src emacs-lisp :tangle init.el :noweb yes
  <<project-functions>>

  <<project-packages>>

  (use-package project
    :bind (("C-x p f" . project-find-file)
           ("C-x p s" . me/project-search)))
#+end_src

*** Project -wide Search

#+begin_src emacs-lisp :noweb-ref project-functions
  (defun me/project-search ()
    "Execute a project wide search with ripgrep."
    (interactive)
    (let ((dir   (cdr (project-current t)))
          (query (read-string "Search query: ")))
      (rg query "*" dir)))
#+end_src

**** TODO Check for a prefix argument and prompt for the filename pattern to search on?

*** Additional Packages

[[https://github.com/dajva/rg.el][rg]] is an Emacs frontend to [[https://github.com/BurntSushi/ripgrep][ripgrep]].

#+begin_src emacs-lisp :noweb-ref project-packages
  (use-package rg
    :ensure t)
#+end_src
* Programming

** C

#+begin_src emacs-lisp :noweb yes :tangle init.el
  <<c-functions>>

  (use-package cc-mode
    :bind (:map c-mode-map
                ("C-c d" . me/start-debugging)
                ("C-c g" . recompile))
    :config
    (setq-default c-basic-offset 4)
    (setq compilation-scroll-output t))
#+end_src


*** Start Debugging

Making use of ~tab-bar.el~ here is a custom function that starts a debugging session by
first opening a new tab. This allows for the use of ~gdb-many-windows~ without messing
with the current window layout.

#+begin_src emacs-lisp :noweb-ref c-functions
  (defun me/start-debugging ()
    (interactive)
    (let ((program (read-string "Debug program: ")))
      (tab-new)
      (setq gdb-many-windows t)
      (gdb (format "gdb -i=mi %s" program))))

#+end_src

*** Stop Debugging

This complements the function above, by listening for the end of the debugging session
and closing the tab. I don't really understand how this works, but I adapted it from
[[https://www.doof.me.uk/2019/06/09/making-emacs-gud-usable/][this blogpost]]

#+begin_src emacs-lisp :noweb-ref c-functions
  (advice-add 'gud-sentinel :after
              (lambda (proc msg)
                (when (memq (process-status proc) '(signal exit))
                  (tab-close))))
#+end_src

** Python

#+begin_src emacs-lisp :noweb yes :tangle init.el
  <<python-functions>>

  <<python-packages>>

  (use-package python
    :bind (:map python-mode-map
                ("C-c C-p" . me/python-open-repl)
                ("C-c g"   . recompile))
    :hook (python-mode . me/python-mode-tweaks)
    :config
    (setq compilation-scroll-output t)
    <<python-config>>)
#+end_src

*** Tweaks

Tweaks to apply when opening Python files

#+begin_src emacs-lisp :noweb-ref python-functions
  (defun me/python-mode-tweaks ()
    (setq-local fill-column 88))

#+end_src

