init.el

(defun me/dired-open-directory ()
  (interactive)
  (dired default-directory))

(defun me/dired-mode-tweaks ()
  (dired-hide-details-mode))

(use-package dired
  :bind (("C-x d" . me/dired-open-directory))
  :hook (dired-mode . me/dired-mode-tweaks))

(use-package git-gutter
  :config
  (global-git-gutter-mode 1)

  (set-face-foreground 'git-gutter:added "forest green")
  (set-face-foreground 'git-gutter:modified "goldenrod")
  (set-face-foreground 'git-gutter:deleted "brown")

  (setq git-gutter:added-sign "▐"
        git-gutter:modified-sign "▐"
        git-gutter:removed-sign "▐"))

(use-package magit
  :bind (("C-x g" . magit-status)))

(defun me/project-search ()
  "Execute a project wide search with ripgrep."
  (interactive)
  (let ((dir   (cdr (project-current t)))
        (query (read-string "Search query: ")))
    (rg query "*" dir)))

(use-package rg
  :ensure t)

(use-package project
  :bind (("C-x p f" . project-find-file)
         ("C-x p s" . me/project-search)))

(defun me/org-mode-tweaks ()
  (setq-local fill-column 80)
  (turn-on-auto-fill)
  (flyspell-mode)

  (org-indent-mode)
  (variable-pitch-mode 1)

  ;; Switch certain elements back to fixed pitch
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil
                      :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org
  :hook (org-mode . me/org-mode-tweaks)
  :bind (("C-c a" . org-agenda)
         ("C-c c" . org-capture))
  :config
  (setq org-directory "~/Documents/org/")
  (setq org-agenda-files (list org-directory))
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((emacs-lisp . t)
                                 (python . t)))
  (setq org-capture-templates
        '(("t" "Task" entry (file+headline "life.org" "Events")
           "* TODO %?\n")
          ("e" "Event" entry (file+headline "life.org" "Events")
           "* %?\nSCHEDULED: %^t")
          ("j" "Journal" entry (file+headline "life.org" "Journal")
           "* %u\n%?\n\n** Exercise\n")))
  (add-to-list 'org-modules 'org-habit t)
  (setq org-habit-show-all-today t
        org-log-into-drawer t))

(defun me/start-debugging ()
  (interactive)
  (let ((program (read-string "Debug program: ")))
    (tab-new)
    (setq gdb-many-windows t)
    (gdb (format "gdb -i=mi %s" program))))

(advice-add 'gud-sentinel :after
            (lambda (proc msg)
              (when (memq (process-status proc) '(signal exit))
                (tab-close))))

(use-package cc-mode
  :bind (:map c-mode-map
              ("C-c d" . me/start-debugging)
              ("C-c g" . recompile))
  :config
  (setq-default c-basic-offset 4)
  (setq compilation-scroll-output t))

(defun me/python-mode-tweaks ()
  (setq-local fill-column 88)
  (add-hook 'after-save-hook 'me/python-flake8-project 0 t))
