README.org
*** Opening a Python REPL

The builtin [[help:python-mode][python-mode]] has a [[help:run-python][run-python]] command that will launch a Python REPL that we
can interact with. Unfortunately by default it will just try runnning your system
python - not very useful.

Instead I have written a function that builds on ~project.el~ that will attempt to find
the project's virtualenv and run a Jupyter REPL, falling back to Python if it is not
installed.

#+begin_src emacs-lisp :noweb-ref python-functions
  (defun me/python-open-repl ()
    "Open a Python REPL in the correct virtualenv for the
    project.

  This will first look for Jupyter and will fall back to Python if
  it's not installed.

  It will attempt to find the root folder for the current package
  and open the shell there.
  "
    (interactive)
    (let* ((dir   (cdr (project-current t)))
           (paths (list
                     (concat dir ".env/bin/jupyter")
                     (concat dir ".env/bin/python")))
           (path  (car (seq-filter 'file-exists-p paths))))

      (setq python-shell-interpreter path
            python-shell-prompt-detect-failure-warning nil)

      (if (string-match-p (regexp-quote "jupyter") path)
          (setq python-shell-interpreter-args "console --simple-prompt")
        (setq python-shell-interpreter-args "-i"))

      (let* ((package-dir (me/python-find-setup-py
                           (buffer-file-name (current-buffer))))
             (default-directory (file-name-directory package-dir)))
        (run-python))))
#+end_src

So that we get to use Jupyer's tab completion, we just need to tell Emacs to not use its
own.

#+begin_src emacs-lisp :noweb-ref python-config
  (add-to-list 'python-shell-completion-native-disabled-interpreters
               "jupyter")
#+end_src

Ensure that the Python REPL opens in the "Panel"

#+begin_src emacs-lisp :noweb-ref window-placement-rules
  ,(me/display-buffer-in-panel
    (me/buffer-select-by-major-mode 'inferior-python-mode))
#+end_src

*** Flake8

I want to run ~flake8~ on the current package every time I save a file. The
method I'm currently using relies on finding the ~setup.py~ file for the current
package and using [[help:compilation-start][compilation-start]] to run ~flake8~ in a compilation buffer.

#+begin_src emacs-lisp :noweb-ref python-functions
  (defun me/python-flake8-project ()
    "Run flake8 on the current project in a compilation buffer.

  This function will attempt to find the setup.py file for the
  package currently being edited using `me/python-find-setup-py'.
  If a filepath is found, its parent directory is assumed to be the
  package root and flake8 will be run in a compilation buffer via
  `compilation-start'."
    (interactive)
    (let* ((filename (buffer-file-name (current-buffer)))
           (setup-py (me/python-find-setup-py filename)))
      (unless (null setup-py)
        (let ((default-directory (file-name-directory setup-py)))
          (compilation-start "flake8" nil
                             (lambda (_modename)
                               (format "%s: flake8" default-directory)))))))

#+end_src

The following methods handle the recursing up the directory tree to find the ~setup.py~

#+begin_src emacs-lisp :noweb-ref python-functions
  (defun me/python-find-setup-py--from-dir (dir)
    (if (string= dir "/")
        nil
      (let* ((setup-py (concat dir "setup.py")))
        (if (file-exists-p setup-py)
            setup-py
          (me/python-find-setup-py
           (file-name-directory (directory-file-name dir)))))))

  (defun me/python-find-setup-py (filename)
    "Find the setup.py file that corresponds with the package that
  contains FILENAME"
    (me/python-find-setup-py--from-dir
     (file-name-directory filename)))

#+end_src

*** Additional Packages

[[https://github.com/pythonic-emacs/blacken][blacken]] will automatcially apply [[https://github.com/psf/black][black]] to the buffer on save.

#+begin_src emacs-lisp :noweb-ref python-packages
  (use-package blacken
    :ensure t
    :hook (python-mode . blacken-mode))
#+end_src

This will of course require the ~black~ command to be available, easiest way to do this
is to install it via [[https://github.com/pipxproject/pipx][pipx]]

#+begin_src sh
pipx install black
#+end_src

** Mermaid

 [[https://mermaid-js.github.io/mermaid/#/][Mermaid Diagrams]]

 #+begin_src emacs-lisp :tangle init.el
   (use-package mermaid-mode
     :ensure t
     :config
     (setq mermaid-mmdc-location mmdc-path))
#+end_src

*** ob-mermaid

[[https://github.com/arnm/ob-mermaid][ob-mermaid]] allows for mermaid diagrams to be used within Org Mode files

#+begin_src emacs-lisp :noweb-ref org-packages
  (use-package ob-mermaid
    :ensure t
    :config
    (setq ob-mermaid-cli-path mmdc-path))
#+end_src

* Prose

** Markdown

#+begin_src emacs-lisp :tangle init.el :noweb yes
  <<markdown-functions>>

  (use-package markdown-mode
    :ensure t
    :hook (gfm-mode . me/gfm-mode-tweaks)
    :mode (("\\.md\\'" . gfm-mode)
           ("\\.markdown\\'" . gfm-mode)))
#+end_src

*** Tweaks

A collection of tweaks to apply when opening a new markdown file

#+begin_src emacs-lisp :noweb-ref markdown-functions
  (defun me/gfm-mode-tweaks ()
    (setq-local fill-column 80)
    (turn-on-auto-fill)
    (flyspell-mode)

    (variable-pitch-mode 1)

    ;; Switch certain elements back to fixed pitch
    (set-face-attribute 'markdown-metadata-key-face nil :inherit 'fixed-pitch)
    (set-face-attribute 'markdown-metadata-value-face nil :inherit 'fixed-pitch))
#+end_src

* Finishing Up
** Custom

Ensure that anything set through ~custom~ is saved to a separate file

#+begin_src emacs-lisp :tangle init.el
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror)
#+end_src

** Startup Time

Add a log message that gives us an indication on how long it took to load the config.

#+begin_src emacs-lisp :tangle init.el
  (let ((startup-time
         (float-time (time-subtract (current-time) emacs-start-time))))
    (message "Loaded configuration in %.3fs" startup-time))
#+end_src

** Auto Tangling

The following ~Local Variables~ block sets up an on save hook that automatically tangles
this file so that ~init.el~ is always in sync with the latest.

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil t)
# End:
