init.el

(defun me/python-open-repl ()
  "Open a Python REPL in the correct virtualenv for the
  project.

This will first look for Jupyter and will fall back to Python if
it's not installed."
  (interactive)
  (let* ((dir   (cdr (project-current t)))
         (paths (list
                   (concat dir ".env/bin/jupyter")
                   (concat dir ".env/bin/python")))
         (path  (car (seq-filter 'file-exists-p paths))))

    (setq python-shell-interpreter path
          python-shell-prompt-detect-failure-warning nil)

    (if (string-match-p (regexp-quote "jupyter") path)
        (setq python-shell-interpreter-args "console --simple-prompt")
      (setq python-shell-interpreter-args "-i"))

    (run-python)))
(defun me/python-flake8-project ()
  "Run flake8 on the current project in a compilation buffer.

This function will attempt to find the setup.py file for the
package currently being edited using `me/python-find-setup-py'.
If a filepath is found, its parent directory is assumed to be the
package root and flake8 will be run in a compilation buffer via
`compilation-start'."
  (interactive)
  (let* ((filename (buffer-file-name (current-buffer)))
         (setup-py (me/python-find-setup-py filename)))
    (unless (null setup-py)
      (let ((default-directory (file-name-directory setup-py)))
        (compilation-start "flake8" nil
                           (lambda (_modename)
                             (format "%s: flake8" default-directory)))))))

(defun me/python-find-setup-py--from-dir (dir)
  (if (string= dir "/")
      nil
    (let* ((setup-py (concat dir "setup.py")))
      (if (file-exists-p setup-py)
          setup-py
        (me/python-find-setup-py
         (file-name-directory (directory-file-name dir)))))))

(defun me/python-find-setup-py (filename)
  "Find the setup.py file that corresponds with the package that
contains FILENAME"
  (me/python-find-setup-py--from-dir
   (file-name-directory filename)))


(use-package blacken
  :ensure t
  :hook (python-mode . blacken-mode))

(use-package python
  :bind (:map python-mode-map
              ("C-c C-p" . me/python-open-repl)
              ("C-c g"   . recompile))
  :hook (python-mode . me/python-mode-tweaks)
  :config
  (setq compilation-scroll-output t)
  (add-to-list 'python-shell-completion-native-disabled-interpreters
               "jupyter"))

(defun me/gfm-mode-tweaks ()
  (setq-local fill-column 80)
  (turn-on-auto-fill)
  (flyspell-mode)

  (variable-pitch-mode 1)

  ;; Switch certain elements back to fixed pitch
  (set-face-attribute 'markdown-metadata-key-face nil :inherit 'fixed-pitch)
  (set-face-attribute 'markdown-metadata-value-face nil :inherit 'fixed-pitch))

(use-package markdown-mode
  :ensure t
  :hook (gfm-mode . me/gfm-mode-tweaks)
  :mode (("\\.md\\'" . gfm-mode)
         ("\\.markdown\\'" . gfm-mode)))

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

(let ((startup-time
       (float-time (time-subtract (current-time) emacs-start-time))))
  (message "Loaded configuration in %.3fs" startup-time))
